src_ext/Catalogs/УЗ_ГруппыОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_ГруппыОбучения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПНВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПНВремя2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВТВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВТВремя2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СРВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СРВремя2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧТВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧТВремя2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПТВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПТВремя2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СБВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СБВремя2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВСВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВСВремя2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/Catalogs/УЗ_ГруппыОбучения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПедагогСоздание(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	УЗ_ОбщийКлиент.СоздатьФизЛицо(ЭтотОбъект, Элемент, "Педагоги");
КонецПроцедуры

&НаКлиенте
Процедура ПНПриИзменении(Элемент)
	ОбновитьДоступностьВремени();
КонецПроцедуры

Процедура ОбновитьДоступностьВремени()

	Если Объект.ПН Тогда
		Элементы.ПНВремя.Доступность = Истина;
		Элементы.ПНВремя2.Доступность = Истина;
	Иначе
		Объект.ПНВремя = Неопределено;
		Объект.ПНВремя2 = Неопределено;
		Элементы.ПНВремя.Доступность = Ложь;
		Элементы.ПНВремя2.Доступность = Ложь;
	КонецЕсли;

	Если Объект.ВТ Тогда
		Элементы.ВТВремя.Доступность = Истина;
		Элементы.ВТВремя2.Доступность = Истина;
	Иначе
		Объект.ВТВремя = Неопределено;
		Объект.ВТВремя2 = Неопределено;
		Элементы.ВТВремя.Доступность = Ложь;
		Элементы.ВТВремя2.Доступность = Ложь;
	КонецЕсли;

	Если Объект.СР Тогда
		Элементы.СРВремя.Доступность = Истина;
		Элементы.СРВремя2.Доступность = Истина;
	Иначе
		Объект.СРВремя = Неопределено;
		Объект.СРВремя2 = Неопределено;
		Элементы.СРВремя.Доступность = Ложь;
		Элементы.СРВремя2.Доступность = Ложь;
	КонецЕсли;

	Если Объект.ЧТ Тогда
		Элементы.ЧТВремя.Доступность = Истина;
		Элементы.ЧТВремя2.Доступность = Истина;
	Иначе
		Объект.ЧТВремя = Неопределено;
		Объект.ЧТВремя2 = Неопределено;
		Элементы.ЧТВремя.Доступность = Ложь;
		Элементы.ЧТВремя2.Доступность = Ложь;
	КонецЕсли;

	Если Объект.ПТ Тогда
		Элементы.ПТВремя.Доступность = Истина;
		Элементы.ПТВремя2.Доступность = Истина;
	Иначе
		Объект.ПТВремя = Неопределено;
		Объект.ПТВремя2 = Неопределено;
		Элементы.ПТВремя.Доступность = Ложь;
		Элементы.ПТВремя2.Доступность = Ложь;
	КонецЕсли;

	Если Объект.СБ Тогда
		Элементы.СБВремя.Доступность = Истина;
		Элементы.СБВремя2.Доступность = Истина;
	Иначе
		Объект.СБВремя = Неопределено;
		Объект.СБВремя2 = Неопределено;
		Элементы.СБВремя.Доступность = Ложь;
		Элементы.СБВремя2.Доступность = Ложь;
	КонецЕсли;

	Если Объект.ВС Тогда
		Элементы.ВСВремя.Доступность = Истина;
		Элементы.ВСВремя2.Доступность = Истина;
	Иначе
		Объект.ВСВремя = Неопределено;
		Объект.ВСВремя2 = Неопределено;
		Элементы.ВСВремя.Доступность = Ложь;
		Элементы.ВСВремя2.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

//ставка группы — зарплата педагога: видна только тому, кому доступна зарплата (как в уроке и карточке педагога)
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.СтавкаПедагога.Видимость = УЗ_Общий.ДоступнаЗарплата();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДоступностьВремени();
КонецПроцедуры

//Состав группы меняет только документ «Перевод ученика» (В29): новый документ, где эта группа — «Из группы»;
//учеников подбирают в нём кнопкой «Заполнить из группы».
&НаКлиенте
Процедура ПеревестиВГруппу(Команда)

	Если Объект.Ссылка.Пустая() Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Сначала запишите группу — затем переводите её учеников'"));
		Возврат;
	КонецЕсли;
	ОткрытьФорму("Документ.УЗ_ПереводУченика.ФормаОбъекта", Новый Структура("Основание", Объект.Ссылка), ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщееВремя(Команда)

	Если Объект.ПН Тогда
		Объект.ПНВремя = Объект.Время;
		Объект.ПНВремя2 = Объект.ВремяОкончания;
	КонецЕсли;

	Если Объект.ВТ Тогда
		Объект.ВТВремя = Объект.Время;
		Объект.ВТВремя2 = Объект.ВремяОкончания;
	КонецЕсли;

	Если Объект.СР Тогда
		Объект.СРВремя = Объект.Время;
		Объект.СРВремя2 = Объект.ВремяОкончания;
	КонецЕсли;

	Если Объект.ЧТ Тогда
		Объект.ЧТВремя = Объект.Время;
		Объект.ЧТВремя2 = Объект.ВремяОкончания;
	КонецЕсли;

	Если Объект.ПТ Тогда
		Объект.ПТВремя = Объект.Время;
		Объект.ПТВремя2 = Объект.ВремяОкончания;
	КонецЕсли;

	Если Объект.СБ Тогда
		Объект.СБВремя = Объект.Время;
		Объект.СБВремя2 = Объект.ВремяОкончания;
	КонецЕсли;

	Если Объект.ВС Тогда
		Объект.ВСВремя = Объект.Время;
		Объект.ВСВремя2 = Объект.ВремяОкончания;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПродолжительностьПриИзменении(Элемент)

	Если НЕ ЗначениеЗаполнено(Объект.Продолжительность) или НЕ ЗначениеЗаполнено(Объект.Время) Тогда
		Возврат;
	КонецЕсли;

	Объект.ВремяОкончания = Объект.Время - ('00010101'-Объект.Продолжительность);

КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.Время) и ЗначениеЗаполнено(Объект.ВремяОкончания) Тогда
		Объект.Продолжительность = '00010101' + (Объект.ВремяОкончания - Объект.Время);
	КонецЕсли;

КонецПроцедуры
